## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
        name                        = "cinema"
+       resource_labels             = {}
        # (26 unchanged attributes hidden)

+       node_pool {
+           initial_node_count          = 1
+           instance_group_urls         = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-11278159-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-3063153e-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroupManagers/gke-cinema-core-d63384c3-grp",
            ]
+           managed_instance_group_urls = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-core-11278159-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-core-3063153e-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroups/gke-cinema-core-d63384c3-grp",
            ]
+           max_pods_per_node           = 128
+           name                        = "core"
+           node_count                  = 1
+           node_locations              = [
+               "us-central1-a",
+               "us-central1-b",
+               "us-central1-c",
            ]
+           version                     = "1.24.3-gke.2100"

+           autoscaling {
+               max_node_count       = 6
+               min_node_count       = 4
+               total_max_node_count = 0
+               total_min_node_count = 0
            }

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           node_config {
+               disk_size_gb      = 15
+               disk_type         = "pd-standard"
+               guest_accelerator = []
+               image_type        = "COS_CONTAINERD"
+               labels            = {
+                   "cluster_name" = "cinema"
+                   "node_pool"    = "core"
                }
+               local_ssd_count   = 0
+               machine_type      = "n2-standard-2"
+               metadata          = {
+                   "cluster_name"             = "cinema"
+                   "disable-legacy-endpoints" = "true"
+                   "node_pool"                = "core"
                }
+               oauth_scopes      = [
+                   "https://www.googleapis.com/auth/logging.write",
+                   "https://www.googleapis.com/auth/monitoring",
                ]
+               preemptible       = false
+               service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-core",
                ]
+               taint             = []

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = 1
+               max_unavailable = 0
            }
        }

        # (19 unchanged blocks hidden)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/prod"] has changed
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-362405/regions/us-central1/subnetworks/prod"
        name                       = "prod"
!       private_ip_google_access   = false -> true
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (config refers to values not yet known)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = (known after apply)
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns will be created
+   resource "google_service_account_key" "external-dns" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
+       public_key         = (known after apply)
+       public_key_type    = "TYPE_X509_PEM_FILE"
+       service_account_id = (known after apply)
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # helm_release.external-dns will be created
+   resource "helm_release" "external-dns" {
+       atomic                     = false
+       chart                      = "external-dns"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "external-dns"
+       namespace                  = "dns"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.bitnami.com/bitnami"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "6.9.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "domainFilters"
+           value = "{wayofthesys.com}"
        }
+       set {
+           name  = "google.serviceAccountSecret"
+           value = "external-dns"
        }
+       set {
+           name  = "policy"
+           value = "sync"
        }
+       set {
+           name  = "provider"
+           value = "google"
        }
+       set {
+           name  = "rbac.create"
+           value = "true"
        }
+       set {
+           name  = "sources"
+           value = "{ingress,service}"
        }
    }

  # kubernetes_secret.external-dns-credentials will be created
+   resource "kubernetes_secret" "external-dns-credentials" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           namespace        = "dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "terrateam-362405"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
!       min_master_version          = "1.24.3-gke.2100" -> (known after apply)
        name                        = "cinema"
        # (26 unchanged attributes hidden)

        # (20 unchanged blocks hidden)
    }

  # module.gke-cinema.random_shuffle.available_zones must be replaced
-/+ resource "random_shuffle" "available_zones" {
!       id           = "-" -> (known after apply)
!       input        = [
-           "us-central1-a",
-           "us-central1-b",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply) # forces replacement
!       result       = [
-           "us-central1-a",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.external-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.external-dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/dns.admin"
    }

  # module.external-dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/prod"] will be updated in-place
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-362405/regions/us-central1/subnetworks/prod"
        name                       = "prod"
!       private_ip_google_access   = true -> false
        # (11 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
